use utf8;
# 宮殿設定ファイル 2003/07/19 由來

# 王様の依頼内容をカスタマイズできます。
# 「依頼文章」，「依頼するアイテム番号」，「個数」の順に記入します。
# 種類はこの要領で増やすことができます。

($msg[0],$itemno[0],$count[0])=(l('看來我國的孩子們現在都喜歡扮演哈利波特。'),57,300);
($msg[1],$itemno[1],$count[1])=(l('我希望我們的人更時尚、更體貼。'),68,50);
($msg[2],$itemno[2],$count[2])=(l('我們國家有病人沒錢買藥。'),31,2000);
($msg[3],$itemno[3],$count[3])=(l('我希望我們的人民多練習武術。'),41,200);
($msg[4],$itemno[4],$count[4])=(l('我希望我們的人民多練習武術。'),53,200);
($msg[5],$itemno[5],$count[5])=(l('我希望我們的人民多練習武術。'),47,200);

#記述例 ($msg[6],$itemno[6],$count[6])=('セリフ',10,100);

# 王様と面会するのに必要な点数(低いと面会を拒否)
# 初心者がいきなり使命を達成しようとすると危険。ある程度高く設定すべし。
$deny_point=20000;

1;
