use utf8;
# 図書館 2005/03/30 由來
#
# 記述内容はカスタマイズできます。
# 見よう見まねで書き換えてみてください。

# １つ目の項目 タイトルと内容 ------------------------------------------------

$TITLE[0]="規則和注意事項";
$CONTENT[0]=<<'HTML';
・<SPAN>規則</SPAN>
請嚴格遵守規則。違反者可能會刪除他們的資料。
規則可能會不定時進行修改。

・<SPAN>多重登入</SPAN>
任何人都不應該擁有一家以上的商店。
遊戲本身有自動防止重複註冊的系統。
即使不是重複註冊，萬一懷疑重複註冊，
請透過郵件向管理員說明。
另外，如果多人使用同一台電腦，
想擁有自己的商店的話，也請發送電子郵件給管理員。

・<SPAN>吵架與辱罵</SPAN>
請避免吵架或使用辱罵性語句。
雖然這是個無法避免競爭的遊戲，
但這只是遊戲，所以不要情緒化。
即使在郵件中，也不要發表可能會冒犯對方的言論。

・<SPAN>遊戲外干涉</SPAN>
請避免在遊戲外干涉或聯絡你透過遊戲認識的人。
可能有捲入犯罪的危險。

・<SPAN>運営妨害・著作権侵害</SPAN>
請不要在遊戲內外進行作弊、蓄意破壞等干擾正常運作的行為，
另外，未經允許，請勿轉載本網站上的任何內容。

・<SPAN>免責聲明</SPAN>
無論是直接的還是間接的，因使用本網站而造成損害時，
管理員不承擔任何責任。
請自行承擔資料的風險。
HTML
# ここまで。上の「HTML」は削除してはいけません。------------------------------

# ２つ目の項目 タイトルと内容 ------------------------------------------------

$TITLE[1]="遊玩方法（初級）";
$CONTENT[1]=<<'HTML';
・<SPAN>遊戲目的</SPAN>
本遊戲可以有很多種目標。
例如，你可以成為排名第一，成為領主，統治城市，
創立商會，擴展人脈，成為賽龍王，
或者也可以結婚過安穩的日子，也是個了不起的目的。
但要做這些事情，你會需要錢。請先賺錢。

・<SPAN>基本操作方法</SPAN>
遊戲中的指令大致分為五類。
每種不同分類會顯示在次級選單裡面。
請學習什麼功能在哪個選單裡面。
首先，可以先看此頁面，並學習如何使用基本功能。

・<SPAN>在留言板上打招呼</SPAN>
您應該做的第一件事是在留言板上打招呼。
這是因為如果沒有與他人合作，就無法期待商店的發展。
要使用言板，首先點選上方選單的[交流]。將出現[留言板]的選單。
重要資訊會不定期發佈在留言板上，請經常查看。

・<SPAN>首次購買</SPAN>
一開始會有10萬的初始金，首先點選[交易]，再選擇裡面的[市場]，
這是世界中的批發市場。在這裡，總之可以先買藥水或乙太來囤貨。
選擇項目後，指定數量，然後選擇「購買」。
此外，如果在市場上找不到想要的東西，最好前往[商店街]。
在那裡你可以買到其他玩家正在出售的東西。有可能比市場便宜，
或者他們也有可能會出售或不會在市場販售上的東西。

・<SPAN>展示和銷售</SPAN>
從市場或商店街購買後，返回【自店】的[倉庫]。
您先前購買的商品都會被儲存在這裡。
現在，讓我們出售我們購買的商品吧。
為此，我們可以透過點選該項目來進行販售。
一開始只有一個展示架，至於售價該訂多少，
可以參考下方的「市價」來進行設定。
如果顯示為「沒有店鋪販售」，則可以以比標準價格高出20%左右的價格出售。
如果降低價格會更容易賣出，但不會因此增加利潤，請注意。
HTML
# ここまで。上の「HTML」は削除してはいけません。------------------------------

# ３つ目の項目 タイトルと内容 ------------------------------------------------

$TITLE[2]="プレイ方法（中級）";
$CONTENT[2]=<<'HTML';
・<SPAN>如何有效地賺錢</SPAN>
到現在為止，我們已經了解購買和販售商品了，
但是為了獲得更多的利潤，必須學習「將材料加工後販售」
然而，為了做到這一點，必須具備必要的技術和材料。
以下簡單介紹進行方法。

・<SPAN>使用禮物卷交換</SPAN>
前往倉庫，選擇禮物卷。然後你可以在下面看到你可以交換的各種東西。
這樣可以取得一部分需要的材料。
如果顯示為「？？？？？」時，則表示此商品使用缺少必要的道具。
嘗試找出如何使用的方法吧。
我們在這邊選擇「交換入門手冊組合」吧。
如果有這些手冊，就能掌握加工技術。

・<SPAN>採購材料</SPAN>
接著我們要進行材料採購，首先我們到市場購買附近山區的地圖。
購買後，使用這張地圖。嘗試進行「探索森林」吧。
應該會得到很多樹枝。這將是木工的材料。
在其他地方四處探索時，將能夠收集不同的東西。
此外，這種材料是可以拿來賣的，在市場是很少販售材料的。

・<SPAN>商品加工</SPAN>
一旦有了材料，就可以使用先前取得的手冊來製造商品。
如果以這種方式加工並銷售商品，您的利潤將逐漸增加。
在處理完商品後，可以回到倉庫。相關手冊的「熟練度」會有所提高。
隨著您的熟練度提高，您將能夠消耗更短的時間內進行加工，
或者還可以進行其他商品的加工。

・<SPAN>增加人氣</SPAN>
一旦業務上軌道後，您應該關心的是「人氣」。人氣較高的商店會賣得更好。
當以「便宜」的價格出售「難以找到的產品」時，人氣就會增加。
反之，如果你以「高價」賣出「隨手可得的商品」，人氣就會下跌。
可以在分類為【交易】的[商店街]中，以「市場調查」找出應該以什麼價格出售什麼樣的商品
您可以一目了然地了解哪些商品的需求量很大，以及市場價格是多少。

・<SPAN>打掃商店</SPAN>
離開商店時，「垃圾」就會慢慢堆積起來。例如，如果你自己把產品扔掉，
它就會變成「垃圾」，或者有顧客來店時，他們也可能會製造「垃圾」。
此外，如果倉庫裡的東西太多，「垃圾」也會堆積起來。
進入商店後可以查看「垃圾」的狀態，可以使用【自店】中的[打掃]進行清理。
店面的清潔度影響人氣，所以需要常常進行打掃。
HTML
# ここまで。上の「HTML」は削除してはいけません。------------------------------

# ４つ目の項目 タイトルと内容 ------------------------------------------------

$TITLE[3]="遊玩方法（用語）";
$CONTENT[3]=<<'HTML';
・<SPAN>決算</SPAN>
在這個城鎮，每36小時會進行決算。下次決算時間在選單上方顯示。
決算時會公布排名，根據結果來頒發獎品，也會確定本期的維護費並進行徵收。
決算時要特別注意的一件事是「借款（高利貸生活）」。
請注意，在很多情況下您無法支付維護費並最終靠貸款生活。

・<SPAN>經費（維護費）</SPAN>
如果您將商品存放在倉庫中，將根據產品數量收取為每個商品的維護費用。
但是，展出的商品只會花費正常維護費用的十分之一。
維護費將在決算時收取，但您可以在【收支】中查看本期累積了多少維護費。
如果維護成本太高，您將處於虧損狀態，因此請盡量保持最低限度的必要庫存。

・<SPAN>稅金（銷售稅）</SPAN>
在這個世界中，您必須向城鎮繳納一種稱為銷售稅的稅。
每次您出售一件商品時，都會自動將一部分利潤作為稅款。
稅率由管理城鎮的領主決定，但在銷售每種產品時，
您以高於標準價格的價格出售的產品越多，稅率就越高。

・<SPAN>借款（高利貸生活）</SPAN>
如果生意不順利，店鋪就會資金不足，負債累累，陷入高利貸生活。
遊戲不會因此結束，但您將無法購買任何東西。
您可能需要通過出售擁有的物品或透過其他商店幫助來募集資金。
或者，在各種手續中進行重新開店也是一種方式。

・<SPAN>再出發（重新開店）</SPAN>
當你失敗而無處可去時，或者當您想重置資料重新開始時，
請從各種手續中選擇重新開店。所有資料將被重置，可以重新開始。

・<SPAN>職業（工作）</SPAN>
剛開始會是自由業，但如果滿足某些條件就可以進行轉職。
就職特定職業後，會有一些效果，比如縮短在擅長的職業中製造商品的時間。
HTML
# ここまで。上の「HTML」は削除してはいけません。------------------------------

# ５つ目の項目 タイトルと内容 ------------------------------------------------

$TITLE[4]="【進階】商會";
$CONTENT[4]=<<'HTML';
・<SPAN>商會</SPAN>
商會是遊戲中的組織。如果滿足條件，玩家可以自由加入。
也可以自己創建商會。活動目的因商會而異，透過加入商會，可以更加享受遊戲的樂趣。

・<SPAN>商會的功能</SPAN>
商會具有以下功能：
(1)如果向同一個商會的商店購買商品時，將獲得補貼（=更便宜購買）。
(2) 將商品販售給商會成員時可以得到補助金（= 更高價出售）。
(3) 處理不需要的商品時會有補償金。
(4)「探偵室」可以檢視一些通常看不到的其他商店的行為。
(5)「作戦室」（留言板）可以與其他商會成員進行聯絡。

・<SPAN>加入商會</SPAN>
加入商會需要事先徵得商會會長或軍師的許可。
檢視想加入的商會資訊，仔細閱讀活動目的與加入條件後，
再透過發信詢問商會會長以進行加入。
此外，加入商會意味著將從那時起跟隨商會會長。
建議仔細考慮是否可以信任會長或活動目的是否滿意。

・<SPAN>商會禮儀</SPAN>
請注意商會附屬商店之間的禮儀。
干擾屬於同一商會的商店是不禮貌的行為。
另外，請注意，更換所屬商會可能會被視為背叛。
請使用商會專屬留言板進行公會活動（會議等）。

・<SPAN>商會軍師</SPAN>
商會會長只能在城鎮內選擇一名玩家擔任軍師。
軍師和會長一樣，可以讓想加入商會的成員加入，
也可以授予商會成員們頭銜，或者驅逐他們。

・<SPAN>商會頭銜</SPAN>
如果為商會成員授予頭銜，將會顯示在商會成員列表上，
該商會成員將能夠發動商會對抗戰。
此外，在跨街道的情況下，要為其他街道的商會成員授予頭銜時，
需要在那裡任命一名軍師來進行。

・<SPAN>從商會除名</SPAN>
商會會長與軍師可以驅逐該街道中的商會成員。
另外，在跨街道的情況下，若要驅逐其他街道的商會成員，
需要在那裡任命一名軍師來進行。

・<SPAN>商會間的戰鬥：商會對抗戰</SPAN>
如果有頭銜的商會成員，可以發動商會對抗戰並掠奪資金，
但只能對資金比自身商會多的商會發動。
但是，效果的大小會受到自身商會的攻擊力與對方商會的防禦力的影響。
此外，如果發動商會對抗戰，即使沒有成功，自己商會的攻擊力與
對方商會的防禦力都會被消耗而降低。

・<SPAN>商會間的戰鬥：加強軍備與攻撃力</SPAN>
商會會長與軍師可以花費商會資金的四分之一來增加商會的攻擊力。
效果的大小受資金數量而影響。

・<SPAN>商會間的戰鬥：會費與防禦力</SPAN>
商會防禦力每次決算時，會消耗各加盟店的會員收入的一部分作為會費。
不包括捐贈等臨時收入。完全由會員費來支出。
此外，另一個商會被商會對抗戰破壞時，防禦力會大幅上升。

・<SPAN>商會間的戰鬥：商會滅亡</SPAN>
透過商會對抗戰，商會資金在某些街道會變為負數。
如果變成了負數，商會將會「滅亡」。
被摧毀的商會，郵件也會從連結的街道消失。

・<SPAN>創立商會</SPAN>
達到一定爵位的玩家可以組織商會，成為會長。
可以從 [商會] 中創立商會。屆時請準備好商會圖示（以後還可以改）。
HTML
# ここまで。上の「HTML」は削除してはいけません。------------------------------

# ６つ目の項目 タイトルと内容 ------------------------------------------------

$TITLE[5]="【進階】賽龍";
$CONTENT[5]=<<'HTML';
・<SPAN>賽龍</SPAN>
就像這個世界中的賽馬。
(1)建造牧場，擁有自己的龍進行比賽，
(2)建立龍房飼養龍，
(3)也有其他的享受方式，比如雇個騎師騎龍。

・<SPAN>＜牧場篇＞先建一個牧場</SPAN>
如果你想養一條龍並在比賽中奔馳，
首先，前往[牧場]，建造屬於自己的牧場。
需要注意的是，建設成本很高，後面也會產生維護費用。
在開始之前請考慮您的財務狀況。

・<SPAN>＜牧場篇＞買龍</SPAN>
龍的獲得方式有兩種：(1)購買新龍，(2)生產。
一開始也別無選擇，只能用買的，所以去[牧場]買。
最多可以擁有3頭龍。

・<SPAN>＜牧場篇＞檢視龍的能力</SPAN>
擁有龍後，點選名稱可檢視詳細資訊。
每條龍的能力具有以下含義。
・速度……龍的原始速度。
・競爭的膽量……不被其他龍超越的精神力量。影響領放和前列。
・爆發力……一種可以讓你快速提升速度的身體能力。影響居中和後追。
・力量……即使腿很重也能繼續奔跑的身體能力。影響砂地、坡道和雨天的比賽。
・健康……維持身體狀況的身體能力。影響恢復量和競爭壽命。
・靈活性…根據整體距離判斷速度的智慧。影響距離能力。

・<SPAN>＜牧場篇＞馴服巨龍</SPAN>
龍的能力可以通過訓練得到極大的提升。
要進行訓練，必須將其放置在龍房中。
所以，請優先考慮進行龍房託管。
此外，取決於你離開它的龍房的訓練策略，主要增加的能力會有所不同。
在[商物運動]的龍房列表中查看訓練策略，根據你想要提升的能力選擇馬厩。


・<SPAN>＜牧場篇＞參加比賽</SPAN>
比賽以兩天為周期進行，登龍賽與重獎賽同時進行。
可以檢視不同類型比賽目前是否接受註冊。
如果是可以註冊的時間段，從[牧場]的龍詳情頁面，
可以選擇騎師和策略並且進行參賽。


・<SPAN>＜牧場篇＞贏得比賽</SPAN>

為了更能確定獲勝，請選擇可以獲勝的比賽。
如果無法贏得比賽，請進行訓練來提高他們的能力。
避免將其參加不適合距離的比賽，而且要以良好的身體狀況與體重參賽。
龍族處理100%由技能和策略決定，沒有隨機因素。
賽龍的運作是隨機的，不是實力與策略100%就可以決定的。
做一些研究，您可能會找到致勝的策略。

・<SPAN>＜牧場篇＞龍的引退</SPAN>
超過10天的龍可以進行退役。
一頭已經變老，失去了身體狀態的龍，
結束了牠的競爭生活，讓牠引退吧。
當一頭退役的龍達到一定的表現水平時，
可以作為物種龍和繁殖雌龍發揮作用。

・<SPAN>＜牧場篇＞龍的生產</SPAN>
如果擁有繁殖雌龍，可以透過配種進行繁殖。（但是，
參賽龍的最大數量是3，所以必須沒有空缺。）
當選擇一條雄龍進行配種並進行交配時，將誕生一條幼龍。
此外，雌龍一旦分娩後，在接下來的三天內不能再次交配。

・<SPAN>＜牧場篇＞如何繁殖好龍</SPAN>
龍的遺傳力有高有低。組合起來的情況，較多的特徵會從雙親遺傳力較高的那一方繼承而來。
但是，即使您能看到自己繁殖的雌龍的遺傳力，您也看不到其他龍的遺傳力。
因此，可以透過嘗試組合成來預測雛龍的遺傳力。
如果能找到一頭能力優秀、遺傳力高的雄龍，就能夠培育出優秀的龍。
此外，配種過程幾乎沒有隨機要素，可以預測和計算。
HTML
# ここまで。上の「HTML」は削除してはいけません。------------------------------

# ７つ目の項目 タイトルと内容 ------------------------------------------------

$TITLE[6]="【進階】領主制度";
$CONTENT[6]=<<'HTML';
・<SPAN>領主制度</SPAN>
這個城鎮由領主統治。玩家可以成為領主，
取決於它的安排方式，這個城鎮可能是宜居的，也可能是難以居住的。
對政治不滿的玩家也可以造反，篡奪主位。

・<SPAN>＜用語篇＞人口</SPAN>
居住在城鎮的居民人數。每家店的顧客越多，銷售額增長。
它會根據城鎮的政治局勢而增加或減少。

・<SPAN>＜用語篇＞街資金</SPAN>
領主可用的資金會隨稅收、政治收入而增加。
如果資金變成負數，稅收無法彌補，僱傭的護衛軍會逃跑。

・<SPAN>＜用語篇＞開拓</SPAN>
表示居民居住的土地和農田的維護情況。
隨著這個數字的增加，該城鎮的人口也會增加。如果土地無人看管，
就會變得荒涼，所以封建領主必須通過撥款開發措施來維護和改善它。

・<SPAN>＜用語篇＞治安</SPAN>
表示居民免受犯罪侵害的程度。
由於是護衛軍維護公共秩序，如果公共秩序低下，維持士兵的成本就會額外增加。
如果無人看管時治安會惡化，因此領主必須通過分配治安經費來進行維護與改善。

・<SPAN>＜用語篇＞護衛軍</SPAN>
保衛城市的軍隊。它由領主支付和僱用的正規軍和自願加入的義勇軍組成。
其中，正規軍有士兵維持費。義勇軍在一定時間後會編入正規軍。

・<SPAN>＜用語篇＞叛亂軍</SPAN>
每個玩家為擊敗他們的領主而僱傭的軍隊。
發生叛亂時，數字會顯露出來，但在平靜的狀態下，數字是未知的。

・<SPAN>＜用語篇＞鎮壓</SPAN>
城主出兵攻打該城的玩家，以鎮壓商店。
被鎮壓的商店將使得居民變得不太會主動靠近，它的人氣將會急劇下降。
此外，雖然鎮壓代價高昂，但在一定程度上也起到了改善公共安全的作用。
鎮壓除了需要一定數量的士兵外，在叛亂發生時也無法進行。

・<SPAN>＜叛亂篇＞起義</SPAN>
若玩家要發動叛亂並擊敗領主，首先需要在[設施]中的[傭兵所]僱傭矮人士兵。
可以僱用的人數取決於您的等級。除非參與叛亂，否則僱傭的士兵將在軍營裡面待命。
如果擁有超過2500名士兵，可以培養他們並發動叛亂。

・<SPAN>＜叛亂篇＞當叛亂發生時</SPAN>
當發生叛亂時，領主的統治能力受到限制，所有商店的基本營業稅都被取消（稅率根據售價增加）。
軍事力量最大的叛亂參與者會成為叛亂領袖，並且成為下任領主的候選人（根據軍事力量而變化）。
因此，如果你的士兵比別人少，自己就無法成為下任領主。
叛亂狀態會顯示在【領主邸】中。

・<SPAN>＜叛亂篇＞參與叛亂</SPAN>
起義的玩家自然會參與叛亂，但其他人也可以通過在【傭兵所】參與叛亂。
當你加入叛亂後，士兵會開始戰鬥，人數逐漸減少。一旦宣布參與叛亂，
在叛亂結束前不能撤退，因此如果您僱用額外的士兵，這些士兵將自動參與叛亂。

・<SPAN>＜叛亂篇＞支持領主</SPAN>
玩家也可以站在領主一邊，將自己的士兵作為義勇軍加入領主的護衛軍。
所有雇用的士兵都會加入了護衛軍。
如果領主親自執行此命令，則將士兵加入正規軍，並產生士兵維護費。

・<SPAN>＜叛亂篇＞叛亂的結果是…</SPAN>
當叛亂爆發時，護衛軍和叛軍將繼續戰鬥，直到被殲滅。
戰況會實時發生變化。因此，如果叛軍被殲滅，叛亂就會被鎮壓，
但如果護衛軍被殲滅，領主就會被趕出城堡，士兵人數最多的商店將成為新的領主。
此時，叛軍將成為新領主的護衛軍（他們將從您的商店中消失）。

・<SPAN>＜叛亂篇＞如何贏得戰鬥</SPAN>
在叛亂中，軍事力量至關重要，因此擁有最多士兵的一方獲勝。
所以，叛亂的一方最好招募更多的盟友來起義，
如果有盟友可以派出義勇軍，就會加入支持領主的勢力。
事前開會制定計劃，如何掌控時機也很重要。
HTML
# ここまで。上の「HTML」は削除してはいけません。------------------------------

# ８つ目の項目 タイトルと内容 ------------------------------------------------

$TITLE[7]="【進階】結婚";
$CONTENT[7]=<<'HTML';
・<SPAN>結婚</SPAN>
玩家可以進行結婚。結婚後，在教堂裡可以使用共享倉庫，
最多可存放一件物品，最高可存2000萬的資金。
共享倉庫不需要維護費。

・<SPAN>如何結婚</SPAN>
想要結婚請前往【設施】的[住宅區]，在左上角的教堂進行求婚。
如果收到求婚的人可點選「求婚」一欄進行接受，
幸福的婚姻（也可以透過取消來拒絕求婚）。
但是，為了結婚，雙方需要準備500萬的結婚基金。
該基金將作為婚後住房的初始儲備金，不會在收支中計算。
另外，請注意，求婚的人成為丈夫，接受求婚的人成為妻子。

・<SPAN>結婚的注意事項</SPAN>
・請事前討論求婚。如果突然被告知，對方會覺得很困擾。
・慎選你的婚姻伴侶。
・如果你們中的一個人關門或轉移，商店消失了，婚姻就會解除，房子裡的東西也會消失。
・請不要在遊戲以外的地方進行干涉，因為這只是遊戲本身的問題。

・<SPAN>關於房屋建設</SPAN>
已婚玩家可以在[住宅區]擁有自己的房子，只要目前還有多餘的地可以進行建設。
如果你有房子，最多可以儲存3種物品以及6000萬資金，還可以進行擴建。
（教堂共享倉庫將被拆除並改建為住宅）。
住宅區很快就會被填滿，所以如果您發現有空缺，請盡快把握機會。
HTML
# ここまで。上の「HTML」は削除してはいけません。------------------------------


$NOMENU=1;
$Q{bk}="none";
$disp.="<BIG>●".l('図書館')."</BIG><br><br>";
$image[0]=GetTagImgKao(l("図書館員"),"lib");

if (defined($Q{t}))
	{
	LibDisp();
	}
	else
	{
	LibList();
	}
OutSkin();
1;


sub LibList
{
$disp.=<<"HTML";
$TB$TR
$TD$image[0]$TD
<SPAN>${\l('図書館員')}</SPAN>：${\l('ゲームをプレイするのに必要な知識から，高度な情報まで')}<br>
${\l('項目ごとに整理されています。よく読んでおくことをおすすめします。')}
$TRE$TBE<br>
HTML

$disp.=$TBT.$TRT.$TD;
foreach(0..$#TITLE)
	{
	$disp.=GetMenuTag("library","●".$TITLE[$_],"t=$_")."<br>";
	}
$disp.=$TRE.$TBE;
}

sub LibDisp
{
$disp.="$TB$TR$TD$image[0]$TD";
$disp.="<SPAN>".l('図書館員')."</SPAN>：".l('%1については，以下の本が見つかりました。',"<BIG>$TITLE[$Q{t}]</BIG>");
$disp.="<br>--- ".GetMenuTag("library","[".l('項目一覧に戻る')."]");
$disp.="$TRE$TBE<br><br>";

$disp.=$TB.$TR.$TD."<pre>";
$disp.=$CONTENT[$Q{t}]."</pre>".$TRE.$TBE;
}
